mcheah/Marlin4MPMD/MPMD_3dPrinter/Drivers/BSP/exclude/stm32f0xx_3dprinter_wifi.c
  /* WIFI module configuration using AT commands */
  switch (pWifi->configPending)
  {
    case -1:
    case 0: 
      break;
    case WIFI_FILE_CREATION_PENDING: /* switch to command mode pending */
      if (pWifi->fileCreationPending==0)
      { 
        pWifi->mode = WIFI_COMMAND_MODE;
        pWifi->configPending=0;
      }
      break;
#if defined(PROD_TEST)
    case WIFI_CONFIG_FS_UPDATE_PENDING: /* file system update on-going */
      if ((pWifi->txFlag == RESET) && (pWifi->fsUpdatePending == 0))
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI; 
        pWifi->restartPending = 2;
        pWifi->configPending = 0;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+CFUN=1\r\n");
      }
      break;
    case WIFI_CONFIG_FS_UPDATE_START: /* start file system update */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI; 
        pWifi->configPending=WIFI_CONFIG_FS_UPDATE_PENDING;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.HTTPDFSUPDATE=192.168.0.2,/");
        strcat((char *)(pWifi->pTxWriteBuffer),pWifi->expectedFsVersion);
        strcat((char *)(pWifi->pTxWriteBuffer),".img\r\n");
      }
      break;
    case WIFI_CONFIG_FS_UPDATE_CONNECT: /* check the http server is responding */
      if (pWifi->txFlag == RESET)
      {
        uint32_t tmp = HAL_GetTick();
        if (tmp < pWifi->lastTime)
        {
          tmp = tmp + (0xFFFFFFFF - pWifi->lastTime);
        }
        else
        {
          tmp = tmp - pWifi->lastTime;
        }
        if (tmp>5000)
        {
          pWifi->lastTime = HAL_GetTick();
          pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
          strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.HTTPGET=192.168.0.2,/\r\n");    
        }
      }
      break;
    case WIFI_CONFIG_FS_UPDATE_CHECK: /* */
      if (pWifi->fsUpdatePending == 1)
      {
        pWifi->configPending=WIFI_CONFIG_FS_UPDATE_CONNECT;
      }
      else if (pWifi->fsUpdatePending == 0)
      {
        pWifi->configPending=0;
      }
      break;
    case WIFI_CONFIG_FS_UPDATE_PRINT_VERSION: /* check file system version */
      if ((pWifi->txFlag == RESET) && (pWifi->restartPending == 0))
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending=WIFI_CONFIG_FS_UPDATE_CHECK;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.FSP=/fsversion.txt\r\n");
      }
      break;
    case WIFI_CONFIG_FS_UPDATE:
      break;
    case WIFI_CONFIG_SAVE_CASE-1: /* reset the module */
      if (pWifi->txFlag == RESET)
      {
        HAL_Delay(100); /* Give the wifi module time to save the settings */
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI; 
        pWifi->restartPending = 2;
        pWifi->configPending=WIFI_CONFIG_FS_UPDATE;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+CFUN=1\r\n");
      }
      break;
#else //#if defined(PROD_TEST)
    case WIFI_CONFIG_SAVE_CASE-1: /* reset the module */
      if (pWifi->txFlag == RESET)
      {
        HAL_Delay(100); /* Give the wifi module time to save the settings */
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI; 
        pWifi->restartPending = 2;
        pWifi->configPending = 0;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+CFUN=1\r\n");
      }
      break;      
#endif //#else //#if defined(PROD_TEST)
    case WIFI_CONFIG_SAVE_CASE: /* Save the settings on the flash memory */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT&W\r\n");
      }
      break;
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-13: /* Enable socket server, default is TCP */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SOCKD=32000\r\n");
      }
      break;  
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-12: /* Change the Mini AP default homepage */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--; /* After last item to configure, next is saving */
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=ip_apredirect,axisctrl.shtml\r\n");
      }
      break; 
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-11: /* Set the MiniAP address */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=ip_ipaddr,192.168.0.1\r\n");
      }
      break; 
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-10: /* Set the use_dhcpmode (0 = DHCP server off, 1 = DHCP server on, 2 = DHCP server on and customizable) */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=ip_use_dhcp,2\r\n");
      }
      break;
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-9: /* Set the network mode (1 = STA, 2 = IBSS, 3 = MiniAP) */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=wifi_mode,3\r\n");
      }
      break; 
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-8: /* Set the network privacy mode (0=OPEN or 1=WEP are supported) */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=wifi_priv_mode,1\r\n");
      }
      break; 
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-7: /* Set authentication type */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=wifi_auth_type,0\r\n");
      }
      break; 
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-6: /* Set the wep key length, 05 or 0D bytes */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        if (strlen(pWifi->wepKey)==10)
        {
          strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=wifi_wep_key_lens,05\r\n");
        }
        else if (strlen(pWifi->wepKey)==26)
        {
          strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=wifi_wep_key_lens,0D\r\n");
        }
        else
        {
          WIFI_ERROR(12);
        }
      }
      break; 
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-5: /* Set the wep key */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SCFG=wifi_wep_keys[0],");
        strcat((char *)(pWifi->pTxWriteBuffer),pWifi->wepKey);
        strcat((char *)(pWifi->pTxWriteBuffer),"\r\n");
      }
      break; 
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-4: /* Set the SSID */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),"AT+S.SSIDTXT=");
        strcat((char *)(pWifi->pTxWriteBuffer),pWifi->ssid);
        strcat((char *)(pWifi->pTxWriteBuffer),"\r\n");
      }
      break;
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-3: /* Wind 0:31 mask */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),\
          "AT+S.SCFG=wind_off_low,0xC8FDFFF9\r\n");
      }
      break;      
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-2: /* Wind 32:63 mask */      
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),\
          "AT+S.SCFG=wind_off_medium,0xA6FFFFFE\r\n");
      }
      break; 
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS-1: /* Wind 64:95 mask */      
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),\
          "AT+S.SCFG=wind_off_high,0xFFFFFFFF\r\n");
      }
      break;
    case WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS: /* Hardware flow control on */
      if (pWifi->txFlag == RESET)
      {
        pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
        pWifi->configPending--;
        strcpy((char *)(pWifi->pTxWriteBuffer),\
          "AT+S.SCFG=console1_hwfc,1\r\n");
      }
      break;
#if defined(PROD_TEST)
    case WIFI_CONFIG_FW_UPDATE: /* Firmware update */
      if (pWifi->txFlag == RESET)
      {
        uint32_t tmp = HAL_GetTick();
        if (tmp < pWifi->lastTime)
        {
          tmp = tmp + (0xFFFFFFFF - pWifi->lastTime);
        }
        else
        {
          tmp = tmp - pWifi->lastTime;
        }
        if (tmp>1000)
        {
          pWifi->state = BSP_WIFI_UART_BYTES_TO_WIFI;
          pWifi->configPending = 0;
          strcpy((char *)(pWifi->pTxWriteBuffer),\
            "AT+S.FWUPDATE=192.168.0.2,/SPWF01S-150410-c2e37a3-RELEASE-main.ota\r\n");
        }
      }
      break;
#endif //#if defined(PROD_TEST)      
    default:
      WIFI_ERROR(8);
  } 
  
  if (((pWifi->state & BSP_WIFI_UART_BYTES_TO_WIFI)\
    == BSP_WIFI_UART_BYTES_TO_WIFI)&&(pWifi->txFlag == RESET))
  {
    nbBytes = strlen((const char*)pWifi->pTxWriteBuffer);
    if (nbBytes != 0)
  {
    pWifi->txFlag = SET;
      /* State is change here to prevent the triggering of a transmit in case   */
      /* no new one has been ordered at the time the tx flag is reset           */
      pWifi->state = BSP_WIFI_UART_BYTES_NONE;
      if(HAL_UART_Transmit_DMA(&(pWifi->uartHandle),\
        (uint8_t *)(pWifi->pTxWriteBuffer), nbBytes)!= HAL_OK)
    {
      WIFI_ERROR(6);
    }
      pWifi->pTxWriteBuffer += nbBytes;
      if (pWifi->pTxWriteBuffer >= pWifi->pTxBuffer + WIFI_UART_TX_BUFFER_SIZE)
      {
        pWifi->pTxWriteBuffer = pWifi->pTxBuffer;
      }
    if (pWifi->mode == WIFI_FILE_APPEND)
    {
      while (pWifi->txFlag != RESET);
    }
  }
  }
 }

 /******************************************************//**
 * @brief Restart the WIFI module by bringing down and high the reset pin
 * @param None
 * @retval None
 **********************************************************/
void BSP_WifiRestart(void)
{
  HAL_Delay(100);
  HAL_GPIO_WritePin(BSP_WIFI_RESET_PORT, BSP_WIFI_RESET_PIN, GPIO_PIN_RESET);
  HAL_Delay(1);
  HAL_GPIO_WritePin(BSP_WIFI_RESET_PORT, BSP_WIFI_RESET_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
}        
 
 /******************************************************//**
 * @brief Create a file in the wifi module RAM and open it in append mode
 * @param fileName file name
 * @param fileSizeWithoutHttpHeader file size without http header
 * @retval BSP_WIFI_FILE_CREATION_OK, BSP_WIFI_FILE_SIZE_TOO_BIG or
 * BSP_WIFI_FILE_NAME_TOO_LONG
 **********************************************************/
uint8_t BSP_WifiCreateFileInWifiModuleRam(const char* fileName,\
  uint16_t fileSizeWithoutHttpHeader)
{
  BspWifiDataType *pWifi = &gBspWifiData;
  char s[10+WIFI_FILE_NAME_LENGTH+8] = "AT+S.FSD=/";
  char configFileTop[] = "HTTP/1.0 200 OK\r\nServer: MyProduct\r\nConnection: close\r\nContent-Type: text/html; charset=UTF-8\r\n\r\n";
  char* ptr;
  uint16_t fileSize = strlen(configFileTop)+fileSizeWithoutHttpHeader;
  
  if (strlen(fileName) > WIFI_FILE_NAME_LENGTH)
    return BSP_WIFI_FILE_NAME_TOO_LONG;
  if (fileSize > WIFI_FILE_MAX_SIZE)
    return BSP_WIFI_FILE_SIZE_TOO_BIG;
  if (pWifi->mode == WIFI_DATA_MODE_AND_GCODE_PARSER)
  {
    /* Escape from data mode */
    pWifi->mode = WIFI_DATA_MODE;
    BSP_WifiParseTxBytes("AT+S.\r", strlen("AT+S.\r"), BSP_WIFI_SOURCE_IS_PLATFORM);
    while (pWifi->mode!=WIFI_COMMAND_MODE);
  }
  else
  {
    pWifi->mode = WIFI_COMMAND_MODE;
  }
  /* Delete the file in the WIFI module RAM if any */
  strcat(s, fileName);
  strcat(s,"\r\n");
  BSP_WifiParseTxBytes(s, strlen(s), BSP_WIFI_SOURCE_IS_PLATFORM);
  while (pWifi->commandPending!=0);
  /* Create the file in the WIFI module RAM */
  strcpy(s, "AT+S.FSC=/");
  strcat(s, fileName);
  ptr = s + strlen(s);
  sprintf(ptr, ",%d\r\n",WIFI_FILE_MAX_SIZE);
  BSP_WifiParseTxBytes(s, strlen(s), BSP_WIFI_SOURCE_IS_PLATFORM);
  while (pWifi->commandPending!=0)
  /* Append the file in the WIFI module RAM */
  strcpy(s, "AT+S.FSA=/");
  strcat(s, fileName);
  ptr = s + strlen(s);
  sprintf(ptr, ",%d\r\n",fileSize);
  BSP_WifiParseTxBytes(s, strlen(s), BSP_WIFI_SOURCE_IS_PLATFORM);
  BSP_WifiParseTxBytes(configFileTop, strlen(configFileTop),\
    BSP_WIFI_SOURCE_IS_PLATFORM);
  
  return BSP_WIFI_FILE_CREATION_OK;
}

 /******************************************************//**
 * @brief Create a file in the wifi module RAM and open it in append mode
 * @param fileName file name
 * @param fileSizeWithoutHttpHeader file size without http header
 * @retval BSP_WIFI_FILE_CREATION_OK, BSP_WIFI_FILE_SIZE_TOO_BIG or
 * BSP_WIFI_FILE_NAME_TOO_LONG
 **********************************************************/
uint8_t BSP_WifiIsFileCreation(void)
{
  BspWifiDataType *pWifi = &gBspWifiData;
  return pWifi->fileCreationPending;
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

